website/app/controllers/saved_search_controller.rb

	def index
		# get the saved searches and reoccurences of this user, it will be displayed
		@savedSearches = current_user.saved_searches
		@reoccurences = current_user.reoccurences

		# For each reoccurence, since we do not actaully repeat the search periodically,
		# everytime the  user visit this page we need to create those missing saved search
		# create all the missing savedsearch according to the reoccurence and existing savedSearches
		today = DateTime.now.to_date
		@reoccurences.each do |reoccurence|
			# if the unit is day
			if reoccurence.unit.downcase == "day" || reoccurence.unit.downcase == "days"
				# from the time this reoccurence is last updated to today
				for date in reoccurence.time.to_date..today
					# if it is a date that the search should be repeated and saved,
					# and that day is not the last updated date for the reoccurence
					if (date - reoccurence.time.to_date)%reoccurence.interval == 0 && date != reoccurence.time.to_date
						# check if this search is already saved
						saved = false
						@savedSearches.each do |savedSearch|
---
SELECT "reoccurences".* FROM "reoccurences" WHERE "reoccurences"."user_id" = ?  [["user_id", 1]]
SELECT "saved_searches".* FROM "saved_searches" WHERE "saved_searches"."user_id" = ?  [["user_id", 1]]

	def destroy
		@saved_search = SavedSearch.find(params[:id])
	    @saved_search.destroy
---
SELECT  "saved_searches".* FROM "saved_searches" WHERE "saved_searches"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "saved_searches" WHERE "saved_searches"."id" = ?  [["id", 1]]

	def destroy_reoccurence
		@reoccurence = Reoccurence.find(params[:id])
	    @reoccurence.destroy
---
SELECT  "reoccurences".* FROM "reoccurences" WHERE "reoccurences"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "reoccurences" WHERE "reoccurences"."id" = ?  [["id", 10]]

	def editing_reoccurence
		# If you are not editing reoccurence but creating reoccurence then don't destroy anything
		if params[:id].present?
			@reoccurence = Reoccurence.find(params[:id])
		    @reoccurence.destroy
		end

		#create and save that new reoccurences
		query = params[:query]
		interval = params[:interval]
		unit = params[:unit]
		time = DateTime.now
		current_user.reoccurences.create(:query => query, :interval => interval, :unit => unit, :time => DateTime.now)
---
SELECT  "reoccurences".* FROM "reoccurences" WHERE "reoccurences"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "reoccurences" WHERE "reoccurences"."id" = ?  [["id", 1]]
INSERT INTO "reoccurences" ("query", "interval", "unit", "time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)