website/app/controllers/table_controller.rb

INSERT INTO "saved_searches" ("query", "time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["query", "haem"], ["time", "2015-10-28 03:44:44.000000"], ["user_id", 1], ["created_at", "2015-10-28 03:44:50.221540"], ["updated_at", "2015-10-28 03:44:50.221540"]]
---
	def save_search
		# save the search result as a saved_search object for this user
		query = params[:query]
		time = params[:time]
		current_user.saved_searches.create(:query => query, :time => time)